Autodesk.Revit.DB.IFC.IFCProductWrapper.AddSite(Autodesk.Revit.DB.IFC.IFCAnyHandle)
Adds a site (IfcObject) handle to associate with the IfcProduct in this wrapper.
siteHandle:
The site handle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.IFCProductWrapper.ClearFinishMaterials
Clear finish materials in this wrapper.
Since:
2013

Autodesk.Revit.DB.IFC.IFCProductWrapper.AddFinishMaterial(Autodesk.Revit.DB.IFC.IFCAnyHandle)
Adds a material handle to associate with the IfcProduct in this wrapper.
material:
The material handle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.IFCProductWrapper.AddAnnotation(Autodesk.Revit.DB.IFC.IFCAnyHandle,Autodesk.Revit.DB.IFC.IFCLevelInfo,System.Boolean)
Adds an annotation handle to associate with the IfcProduct in this wrapper.
Remarks:
If the IFCLevelInfo is not provided, and relateToLevel to true, the handle will be associated to the building handle.
annoHnd:
The annotation handle.
levelInfo:
Information on the associated level.  Optional, can be null.
relateToLevel:
True to relate the annotation to the level, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.IFCProductWrapper.AddElement(Autodesk.Revit.DB.IFC.IFCAnyHandle,Autodesk.Revit.DB.IFC.IFCLevelInfo,Autodesk.Revit.DB.IFC.IFCExtrusionCreationData,System.Boolean)
Adds an IfcElement handle to associate with the IfcProduct in this wrapper.
Remarks:
If the IFCLevelInfo is not provided, and relateToLevel to true, the handle will be associated to the building handle.
elementHandle:
The IfcElement handle.
pLevelInfo:
The level info.
params:
The extrusion creation data associated with the given element.  Optional, can be null.
relateToLevel:
True to relate the element to the level, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.IFCProductWrapper.AddBuilding(Autodesk.Revit.DB.IFC.IFCAnyHandle)
Adds an IfcBuilding handle to associate with the IfcProduct in this wrapper.
buildingHandle:
The IfcBuilding handle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.IFCProductWrapper.AddSpace(Autodesk.Revit.DB.IFC.IFCAnyHandle,Autodesk.Revit.DB.IFC.IFCLevelInfo,Autodesk.Revit.DB.IFC.IFCExtrusionCreationData,System.Boolean)
Adds an IfcSpace handle to associate with the IfcProduct in this wrapper.
Remarks:
If the IFCLevelInfo is not provided, and relateToLevel to true, the handle will be associated to the building handle.
spaceHandle:
The IfcSpace handle.
pLevelInfo:
Information on the associated level.
pParams:
The extrusion creation data associated with the given space.  Optional, can be null.
relateToLevel:
True to relate the space to the level, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.IFCProductWrapper.FindExtrusionCreationParameters(Autodesk.Revit.DB.IFC.IFCAnyHandle)
Obtains the extrusion creation data associated with the given element.
elementHandle:
The handle.
Returns:
The parameters. null if no parameters are associated with the element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.IFCProductWrapper.GetAnElement
Gets the first element handle added to this wrapper.
Returns:
The handle.
Since:
2013

Autodesk.Revit.DB.IFC.IFCProductWrapper.GetAllObjects
Gets all objects associated with the IfcProduct in this wrapper.
Returns:
The collection of objects.
Since:
2012

Autodesk.Revit.DB.IFC.IFCProductWrapper.Create(Autodesk.Revit.DB.IFC.IFCProductWrapper,System.Boolean)
Establishes a new product manager for elements and objects derived from a parent product manager, allowing override of allowRelateToLevel
pProductWrapper:
The parent product manager.
allowRelateToLevel:
True to allow associated elements and objects to relate to a level, false to never allow such a
relationship.
Returns:
The new product manager.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.IFCProductWrapper.Create(Autodesk.Revit.DB.IFC.IFCProductWrapper)
Establishes a new product manager for elements and objects derived from a parent product manager.
pProductWrapper:
The parent product manager.
Returns:
The new product manager.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.IFCProductWrapper.Create(Autodesk.Revit.DB.IFC.ExporterIFC,System.Boolean)
Establishes a new baseline product manager for elements and objects.
Remarks:
Elements and objects associated to this product manager will be associated to a top-level IfcProduct based on the world coordinate
system of the output file.
ExporterIFC:
The exporter.
allowRelateToLevel:
True to allow associated elements and objects to relate to a level, false to never allow such a
relationship.
Returns:
The new baseline product manager.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.IFCProductWrapper.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IFC.IFCProductWrapper.Count
The number of objects associated with the IfcProduct in this wrapper.
Since:
2012

Autodesk.Revit.DB.IFC.IFCProductWrapper
This class is used to ensure that elements and objects are associated with the current IfcProduct.
Remarks:
Each instance makes sure that any elements and products created during its lifetime are properly associated to their parent level (or other containing object).
To ensure that the lifetime of the object is correctly managed, you should declare an instance of this class as a part of a 'using' statement in C# or
similar construct in other lanuguages.
Since:
2012